7767517
195 209
Input            0                        0 1 0
Convolution      644                      1 1 0 644 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=864
BatchNorm        645                      1 1 644 645 0=32
Clip             646                      1 1 645 646 0=0.000000 1=6.000000
Padding          647                      1 1 646 647 0=0 1=1 2=0 3=1 4=0 5=0.000000
ConvolutionDepthWise 648                      1 1 647 648 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=288 7=32
BatchNorm        649                      1 1 648 649 0=32
Clip             650                      1 1 649 650 0=0.000000 1=6.000000
Convolution      651                      1 1 650 651 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=512
BatchNorm        652                      1 1 651 652 0=16
Padding          653                      1 1 652 653 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      654                      1 1 653 654 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1536
BatchNorm        655                      1 1 654 655 0=96
Clip             656                      1 1 655 656 0=0.000000 1=6.000000
ConvolutionDepthWise 657                      1 1 656 657 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 5=0 6=864 7=96
BatchNorm        658                      1 1 657 658 0=96
Clip             659                      1 1 658 659 0=0.000000 1=6.000000
Convolution      660                      1 1 659 660 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=2304
BatchNorm        661                      1 1 660 661 0=24
Split            splitncnn_0              1 2 661 661_splitncnn_0 661_splitncnn_1
Padding          662                      1 1 661_splitncnn_1 662 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      663                      1 1 662 663 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456
BatchNorm        664                      1 1 663 664 0=144
Clip             665                      1 1 664 665 0=0.000000 1=6.000000
ConvolutionDepthWise 666                      1 1 665 666 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1296 7=144
BatchNorm        667                      1 1 666 667 0=144
Clip             668                      1 1 667 668 0=0.000000 1=6.000000
Convolution      669                      1 1 668 669 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456
BatchNorm        670                      1 1 669 670 0=24
BinaryOp         671                      2 1 661_splitncnn_0 670 671 0=0
Padding          672                      1 1 671 672 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      673                      1 1 672 673 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456
BatchNorm        674                      1 1 673 674 0=144
Clip             675                      1 1 674 675 0=0.000000 1=6.000000
ConvolutionDepthWise 676                      1 1 675 676 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 5=0 6=1296 7=144
BatchNorm        677                      1 1 676 677 0=144
Clip             678                      1 1 677 678 0=0.000000 1=6.000000
Convolution      679                      1 1 678 679 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=4608
BatchNorm        680                      1 1 679 680 0=32
Split            splitncnn_1              1 2 680 680_splitncnn_0 680_splitncnn_1
Padding          681                      1 1 680_splitncnn_1 681 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      682                      1 1 681 682 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        683                      1 1 682 683 0=192
Clip             684                      1 1 683 684 0=0.000000 1=6.000000
ConvolutionDepthWise 685                      1 1 684 685 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1728 7=192
BatchNorm        686                      1 1 685 686 0=192
Clip             687                      1 1 686 687 0=0.000000 1=6.000000
Convolution      688                      1 1 687 688 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        689                      1 1 688 689 0=32
BinaryOp         690                      2 1 680_splitncnn_0 689 690 0=0
Split            splitncnn_2              1 2 690 690_splitncnn_0 690_splitncnn_1
Padding          691                      1 1 690_splitncnn_1 691 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      692                      1 1 691 692 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        693                      1 1 692 693 0=192
Clip             694                      1 1 693 694 0=0.000000 1=6.000000
ConvolutionDepthWise 695                      1 1 694 695 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1728 7=192
BatchNorm        696                      1 1 695 696 0=192
Clip             697                      1 1 696 697 0=0.000000 1=6.000000
Convolution      698                      1 1 697 698 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        699                      1 1 698 699 0=32
BinaryOp         700                      2 1 690_splitncnn_0 699 700 0=0
Padding          701                      1 1 700 701 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      702                      1 1 701 702 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        703                      1 1 702 703 0=192
Clip             704                      1 1 703 704 0=0.000000 1=6.000000
ConvolutionDepthWise 705                      1 1 704 705 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 5=0 6=1728 7=192
BatchNorm        706                      1 1 705 706 0=192
Clip             707                      1 1 706 707 0=0.000000 1=6.000000
Convolution      708                      1 1 707 708 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=12288
BatchNorm        709                      1 1 708 709 0=64
Split            splitncnn_3              1 2 709 709_splitncnn_0 709_splitncnn_1
Padding          710                      1 1 709_splitncnn_1 710 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      711                      1 1 710 711 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        712                      1 1 711 712 0=384
Clip             713                      1 1 712 713 0=0.000000 1=6.000000
ConvolutionDepthWise 714                      1 1 713 714 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456 7=384
BatchNorm        715                      1 1 714 715 0=384
Clip             716                      1 1 715 716 0=0.000000 1=6.000000
Convolution      717                      1 1 716 717 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        718                      1 1 717 718 0=64
BinaryOp         719                      2 1 709_splitncnn_0 718 719 0=0
Split            splitncnn_4              1 2 719 719_splitncnn_0 719_splitncnn_1
Padding          720                      1 1 719_splitncnn_1 720 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      721                      1 1 720 721 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        722                      1 1 721 722 0=384
Clip             723                      1 1 722 723 0=0.000000 1=6.000000
ConvolutionDepthWise 724                      1 1 723 724 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456 7=384
BatchNorm        725                      1 1 724 725 0=384
Clip             726                      1 1 725 726 0=0.000000 1=6.000000
Convolution      727                      1 1 726 727 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        728                      1 1 727 728 0=64
BinaryOp         729                      2 1 719_splitncnn_0 728 729 0=0
Split            splitncnn_5              1 2 729 729_splitncnn_0 729_splitncnn_1
Padding          730                      1 1 729_splitncnn_1 730 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      731                      1 1 730 731 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        732                      1 1 731 732 0=384
Clip             733                      1 1 732 733 0=0.000000 1=6.000000
ConvolutionDepthWise 734                      1 1 733 734 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456 7=384
BatchNorm        735                      1 1 734 735 0=384
Clip             736                      1 1 735 736 0=0.000000 1=6.000000
Convolution      737                      1 1 736 737 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        738                      1 1 737 738 0=64
BinaryOp         739                      2 1 729_splitncnn_0 738 739 0=0
Padding          740                      1 1 739 740 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      741                      1 1 740 741 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        742                      1 1 741 742 0=384
Clip             743                      1 1 742 743 0=0.000000 1=6.000000
ConvolutionDepthWise 744                      1 1 743 744 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456 7=384
BatchNorm        745                      1 1 744 745 0=384
Clip             746                      1 1 745 746 0=0.000000 1=6.000000
Convolution      747                      1 1 746 747 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=36864
BatchNorm        748                      1 1 747 748 0=96
Split            splitncnn_6              1 2 748 748_splitncnn_0 748_splitncnn_1
Padding          749                      1 1 748_splitncnn_1 749 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      750                      1 1 749 750 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        751                      1 1 750 751 0=576
Clip             752                      1 1 751 752 0=0.000000 1=6.000000
ConvolutionDepthWise 753                      1 1 752 753 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=5184 7=576
BatchNorm        754                      1 1 753 754 0=576
Clip             755                      1 1 754 755 0=0.000000 1=6.000000
Convolution      756                      1 1 755 756 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        757                      1 1 756 757 0=96
BinaryOp         758                      2 1 748_splitncnn_0 757 758 0=0
Split            splitncnn_7              1 2 758 758_splitncnn_0 758_splitncnn_1
Padding          759                      1 1 758_splitncnn_1 759 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      760                      1 1 759 760 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        761                      1 1 760 761 0=576
Clip             762                      1 1 761 762 0=0.000000 1=6.000000
ConvolutionDepthWise 763                      1 1 762 763 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=5184 7=576
BatchNorm        764                      1 1 763 764 0=576
Clip             765                      1 1 764 765 0=0.000000 1=6.000000
Convolution      766                      1 1 765 766 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        767                      1 1 766 767 0=96
BinaryOp         768                      2 1 758_splitncnn_0 767 768 0=0
Padding          769                      1 1 768 769 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      770                      1 1 769 770 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        771                      1 1 770 771 0=576
Clip             772                      1 1 771 772 0=0.000000 1=6.000000
ConvolutionDepthWise 773                      1 1 772 773 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=5184 7=576
BatchNorm        774                      1 1 773 774 0=576
Clip             775                      1 1 774 775 0=0.000000 1=6.000000
Convolution      776                      1 1 775 776 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=92160
BatchNorm        777                      1 1 776 777 0=160
Split            splitncnn_8              1 2 777 777_splitncnn_0 777_splitncnn_1
Padding          778                      1 1 777_splitncnn_1 778 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      779                      1 1 778 779 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        780                      1 1 779 780 0=960
Clip             781                      1 1 780 781 0=0.000000 1=6.000000
ConvolutionDepthWise 782                      1 1 781 782 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8640 7=960
BatchNorm        783                      1 1 782 783 0=960
Clip             784                      1 1 783 784 0=0.000000 1=6.000000
Convolution      785                      1 1 784 785 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        786                      1 1 785 786 0=160
BinaryOp         787                      2 1 777_splitncnn_0 786 787 0=0
Split            splitncnn_9              1 2 787 787_splitncnn_0 787_splitncnn_1
Padding          788                      1 1 787_splitncnn_1 788 0=0 1=1 2=0 3=1 4=0 5=0.000000
Convolution      789                      1 1 788 789 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        790                      1 1 789 790 0=960
Clip             791                      1 1 790 791 0=0.000000 1=6.000000
ConvolutionDepthWise 792                      1 1 791 792 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8640 7=960
BatchNorm        793                      1 1 792 793 0=960
Clip             794                      1 1 793 794 0=0.000000 1=6.000000
Convolution      795                      1 1 794 795 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        796                      1 1 795 796 0=160
BinaryOp         797                      2 1 787_splitncnn_0 796 797 0=0
Padding          798                      1 1 797 798 0=0 1=2 2=0 3=2 4=0 5=0.000000
Convolution      799                      1 1 798 799 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        800                      1 1 799 800 0=960
Clip             801                      1 1 800 801 0=0.000000 1=6.000000
ConvolutionDepthWise 802                      1 1 801 802 0=960 1=3 11=3 2=2 12=2 3=1 13=1 4=0 14=0 5=0 6=8640 7=960
BatchNorm        803                      1 1 802 803 0=960
Clip             804                      1 1 803 804 0=0.000000 1=6.000000
Convolution      805                      1 1 804 805 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=307200
BatchNorm        806                      1 1 805 806 0=320
Split            splitncnn_10             1 5 806 806_splitncnn_0 806_splitncnn_1 806_splitncnn_2 806_splitncnn_3 806_splitncnn_4
Convolution      807                      1 1 806_splitncnn_4 807 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=81920
BatchNorm        808                      1 1 807 808 0=256
ReLU             809                      1 1 808 809
Convolution      810                      1 1 806_splitncnn_3 810 0=256 1=3 11=3 2=6 12=6 3=1 13=1 4=6 14=6 5=0 6=737280
BatchNorm        811                      1 1 810 811 0=256
ReLU             812                      1 1 811 812
Convolution      813                      1 1 806_splitncnn_2 813 0=256 1=3 11=3 2=12 12=12 3=1 13=1 4=12 14=12 5=0 6=737280
BatchNorm        814                      1 1 813 814 0=256
ReLU             815                      1 1 814 815
Convolution      816                      1 1 806_splitncnn_1 816 0=256 1=3 11=3 2=18 12=18 3=1 13=1 4=18 14=18 5=0 6=737280
BatchNorm        817                      1 1 816 817 0=256
ReLU             818                      1 1 817 818
Pooling          819                      1 1 806_splitncnn_0 819 0=1 4=1
Convolution      820                      1 1 819 820 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=81920
BatchNorm        821                      1 1 820 821 0=256
ReLU             822                      1 1 821 822
Interp           824                      1 1 822 824 0=2 1=30.000000 2=30.000000
Concat           825                      5 1 809 812 815 818 824 825 0=0
Convolution      826                      1 1 825 826 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=2560
Interp           828                      1 1 826 828 0=2 1=16.000000 2=16.000000
